/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                                 By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: DHT11.C
** 创建人员: wht
** 创建日期: 2019-02-01
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/

#include "DHT11.H"
#include "delay.h"

uint8 DHT11_RT[2];
/*------------------------------------------------
              DHT11开始信号
------------------------------------------------*/
void DHT11_start()
{
    DHT11_IO=1;
    delayxus(2);
    DHT11_IO=0;
    delayxms(20);   //延时18ms以上
		DHT11_IO=1;   //转换为输入
    delayxus(20);
}
/*------------------------------------------------
              接收八位二进制
------------------------------------------------*/
uint8 DHT11_rec_byte()      //接收一个字节
{
    uint8 i,dat=0;
    for(i=0; i<8; i++)  //从高到低依次接收8位数据
    {
        while(!DHT11_IO);   ////等待50us低电平过去
        delayxus(30);     //延时60us，如果还为高则数据为1，否则为0
        dat<<=1;           //移位使正确接收8位数据，数据为0时直接移位
        if(DHT11_IO==1)    //数据为1时，使dat加1来接收数据1
            dat+=1;
        while(DHT11_IO);  //等待数据线拉低
    }
    return dat;
}
/*------------------------------------------------
              接收40bit数据
8位湿度整数+8位湿度小数+8位温度整数+8位温度小数+8位校验，并且返回数据位16进制BCD格式，需要转换为DEC
校验格式：前4个字节相加的低8位
------------------------------------------------*/
void DHT11_receive()      //接收40位的数据
{
    uint8 R_H,R_L,T_H,T_L,RH,RL,TH,TL,revise;

	DHT11_start();//主机发送开始信号

	if(DHT11_IO==0)//从机接收到开始信号后，先0：80us；然后1：80us，接着传送数据
    {

        while(DHT11_IO==0);   //等待拉高  结束

        delayxus(42);  //拉高后延时80us
        R_H=DHT11_rec_byte();    //接收湿度高八位
        R_L=DHT11_rec_byte();    //接收湿度低八位
        T_H=DHT11_rec_byte();    //接收温度高八位
        T_L=DHT11_rec_byte();    //接收温度低八位
        revise=DHT11_rec_byte(); //接收校正位

        delayxus(40);    //结束

        if((R_H+R_L+T_H+T_L)==revise)      //校正
        {
            RH=R_H;
            RL=R_L;
            TH=T_H;
            TL=T_L;
        }
        /*数据处理，方便显示，保留整数部分*/
        DHT11_RT[0]=RH;
        DHT11_RT[1]=TH;

    }
}


/********************************End of File************************************/