/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                                 By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: ds1302.c
** 创建人员: wht
** 创建日期: 2019-02-17
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/

#include"ds1302.h"

//---DS1302写入和读取时分秒的地址命令---//
//---秒分时日月周年 最低位读写位;-------//
uint8 code READ_RTC_ADDR[7] = {0x81, 0x83, 0x85, 0x87, 0x89, 0x8b, 0x8d};
uint8 code WRITE_RTC_ADDR[7] = {0x80, 0x82, 0x84, 0x86, 0x88, 0x8a, 0x8c};

//---DS1302时钟初始化2016年5月7日星期六12点00分00秒。---//
//---存储顺序是秒分时日月周年,存储格式是用BCD码---//
uint8 Time[7] = {0x00, 0x37, 0x12, 0x02, 0x02, 0x06, 0x19};
int8 OldTime[7];
/*******************************************************************************
* 函 数 名         : Ds1302Write
* 函数功能         : 向DS1302命令（地址+数据）
* 输    入         : addr,dat
* 输    出         : 无
*******************************************************************************/

void Ds1302Write(uint8 addr, uint8 dat)
{
    uint8 n;
    DS1302_RST = 0;
    _nop_();

    DS1302_CLK = 0;//先将DS1302_CLK置低电平。
    _nop_();
    DS1302_RST = 1; //然后将DS1302_RST(CE)置高电平。
    _nop_();

    for (n=0; n<8; n++)//开始传送八位地址命令
    {
        DS1302_IO = addr & 0x01;//数据从低位开始传送
        addr >>= 1;
        DS1302_CLK = 1;//数据在上升沿时，DS1302读取数据
        _nop_();
        DS1302_CLK = 0;
        _nop_();
    }
    for (n=0; n<8; n++)//写入8位数据
    {
        DS1302_IO = dat & 0x01;
        dat >>= 1;
        DS1302_CLK = 1;//数据在上升沿时，DS1302读取数据
        _nop_();
        DS1302_CLK = 0;
        _nop_();
    }

    DS1302_RST = 0;//传送数据结束
    _nop_();
}

/*******************************************************************************
* 函 数 名         : Ds1302Read
* 函数功能         : 读取一个地址的数据
* 输    入         : addr
* 输    出         : dat
*******************************************************************************/

uint8 Ds1302Read(uint8 addr)
{
    uint8 n,dat,dat1;
    DS1302_RST = 0;
    _nop_();

    DS1302_CLK = 0;//先将DS1302_CLK置低电平。
    _nop_();
    DS1302_RST = 1;//然后将DS1302_RST(CE)置高电平。
    _nop_();

    for(n=0; n<8; n++)//开始传送八位地址命令
    {
        DS1302_IO = addr & 0x01;//数据从低位开始传送
        addr >>= 1;
        DS1302_CLK = 1;//数据在上升沿时，DS1302读取数据
        _nop_();
        DS1302_CLK = 0;//DS1302下降沿时，放置数据
        _nop_();
    }
    _nop_();
    for(n=0; n<8; n++)//读取8位数据
    {
        dat1 = DS1302_IO;//从最低位开始接收
        dat = (dat>>1) | (dat1<<7);
        DS1302_CLK = 1;
        _nop_();
        DS1302_CLK = 0;//DS1302下降沿时，放置数据
        _nop_();
    }

    DS1302_RST = 0;
    _nop_();    //以下为DS1302复位的稳定时间,必须的。
    DS1302_CLK = 1;
    _nop_();
    DS1302_IO = 0;
    _nop_();
    DS1302_IO = 1;
    _nop_();
    return dat;
}

/*******************************************************************************
* 函 数 名         : Ds1302Init
* 函数功能         : 初始化DS1302.
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Ds1302Init(void)
{
    uint8 n;
    Ds1302Write(0x8E,0X00);      //禁止写保护，就是关闭写保护功能
    for (n=0; n<7; n++)//写入7个字节的时钟信号：分秒时日月周年
    {
        Ds1302Write(WRITE_RTC_ADDR[n],Time[n]);
    }
    Ds1302Write(0x8E,0x80);      //打开写保护功能
}

/*******************************************************************************
* 函 数 名         : Ds1302ReadTime
* 函数功能         : 读取时钟信息
* 输    入         : 无
* 输    出         : 无
time[7]=0   1   2   3   4   5   6 
        秒  分  时  日  月  周  年
*******************************************************************************/

void Ds1302ReadTime(void)
{
    uint8 n;
    for (n=0; n<7; n++)//读取7个字节的时钟信号：分秒时日月周年
    {
        Time[n] = Ds1302Read(READ_RTC_ADDR[n]);
    }

}
/********************************End of File************************************/
