/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                                By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: pca.h
** 创建人员: wht
** 创建日期: 2019-02-20
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/

#ifndef __PCA_H_
#define __PCA_H_

#include <15W4KxxS4.h>
#include <intrins.h>
#include "stdio.h"
#include "config.h"
#include "led.h"
#include "usart.h"

void pca_init(void);
void pca_dinit(void);
void pca_demo(void);


#endif


/********************************End of File************************************/