/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2018, Main, China, QD.
**                           All Rights Reserved
**
**                                By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: delay.h
** 创建人员: wht
** 创建日期: 2018-12-21
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/

#ifndef __DELAY_H_
#define __DELAY_H_
#include "config.h"
#include "intrins.h"

void delayxus(uint16 tus);
void delayxms(uint16 tms);


#endif


/********************************End of File************************************/