/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2018, Main, China, QD.
**                           All Rights Reserved
**
**                                 By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: delay.c
** 创建人员: wht
** 创建日期: 2018-12-21
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/
#include "delay.h"

void delayxus(uint16 tus)       //@11.0592MHz  1.98us  nop为单周期指令
{
    while(tus--)
    {
        _nop_();
        _nop_();
        _nop_();
			  _nop_();
    }
}

void delayxms(uint16 tms)
{
    unsigned char i, j;
    while(tms--)
    {
        _nop_();
        _nop_();
        _nop_();
        i = 11;
        j = 190;
        do
        {
            while (--j);
        }
        while (--i);
    }
}

/********************************End of File************************************/
