/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2019, Main, China, QD.
**                           All Rights Reserved
**
**                                By(wo4fisher)
**                           http://www.wo4fisher.com
**
**----------------------------------文件信息------------------------------------
** 文件名称: buzzer.h
** 创建人员: wht
** 创建日期: 2019-06-07
** 文档描述: 
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/
 
#ifndef __BUZZER_H_
#define __BUZZER_H_

#include <15W4KxxS4.h>
#include <INTRINS.H>
#include "delay.h"

sbit Beep =  P2 ^ 3;

void play_tick(void);
#endif

 
/********************************End of File************************************/